/* Вивести на сторінку в один рядок через кому числа від 0 до 20. || WHILE
  - Вивести квадрати чисел від 25 до 40. || WHILE
  - Вивести таблицю множення на 4. | FOR
  - Знайти суму всіх цілих чисел від 1 до 15. | FOR
  - Вивести всі числа в діапазоні від 100 до 200 кратні 3. | WHILE
  - Дано натуральне число. 
    * Знайти та вивести на сторінку всі його дільники. | WHILE
    Дільником натурального числа а називається таке натуральне число, на яке а ділиться без остачі.
    * Визначити кількість його парних дільників.
    * Знайти суму його парних дільників. 
  - Надрукувати повну таблицю множення від 1 до 10. | FOR
  - Програма для вгадуваання числа | DO WHILE
*/
