module.exports = [
  [{
    title: 'Заповнювач масива',
    description: `Створити функцію яка заповнить масив до заданого розміру заданим символом 
    func(8, 'ak') => ['ak','ak','ak','ak','ak','ak','ak','ak']`
  },
  {
    title: 'Екран',
    description: `Створити функцію, яка видаляє зі строки всі символи, які ми передали другим аргументом.. 
    Вихідну строку і символи для видалення задає користувач
    func('Hello, John', 'lo') => 'He, Jhn'`,
  },
  {
    title: 'Обєднювач масивів',
    description: `Створити функцію яка приймає безліч масивів, та обєднює їх в один і повертає
      func([5,6], [6], [8,1]) => [5,6,6,8,1]
    `,
  },
  {
    title: 'Калькулятор',
    description: `Створити функцію doMath(x, znak, y), яка отримує 3 аргументи: числа x і y, строку znak. 
    У змінному знаку можуть бути: +, -, *, /, %, ^ (степіть). 
    Вивести результат математичного дії, зазначеного в змінному знаку. 
    Обидва числа і знак отримуються від користувача.`,
  },
  {
    title: 'Очисник масива',
    description: `Створити функцію яка видаляє з масива усі елементи які рівні заданому символу
    func([2,3,5,6,6,7], 6) => [2,3,5,7]`
  }, 
  {
    title: 'Останнє слово',
    description: `Створити функцію яка очікує стрічку і повертає його останнє слово
    func('Hello dear friend') => 'friend'`,
  },
  {
    title: 'Середнє значення масива',
    description: `Створити функцію яка очікує масив та повертає середнє арифметичне значення елементів масиву
    func([3,10,5]) => 5`,
  },
  {
    title: 'Автошкола',
    description: `Створити функцію яка очікує обєкт та повертає цей обєкт з новою властивість driverLicense
      func({ name: 'Oksana', age: 22,}) => {
        name: 'Oksana',
        age: 22, 
        driverLicense: {
          car: true, 
          bus: true
          truck: false,
        },
      }
      const RULES = {
        car: 18,
        bus: 20,
        truck: 25,
      };
    `,
  },
  {
    title: 'Анкета',
    description: `Створити функцію яка задає користувачу 5 запитань, Імя, Місто, Вік, Країна, Улюблений колір, значення записує в обєкт та поверта
    є його
     Імя повинно бути приведено до верхнього регістру
     Місто повинно бути приведено до нижнього регістру,
     Улюблений колір повиннен чергувати великий та нижній регісти бути ЖоВтИй`,
  },
  {
    title: 'Введення дробового числа',
    description:`Створити функцію яка просить в користувача спочатку ввести дробове число, а потім ввести до скількох чисел після коми округлювати і повертає число
    Користувач ввів 74.57676 і 3 функція повинна повертнути 74.577`,
  }],
  [
    {
      title: 'Інтервал',
      description: `Потрібно вивести 5 алертів з інтервалом у 3 секунди, після 5-го зупинити інтервал
      Отримані значення записати у масив та вивести після 5 алерта`
    },
    {
      title: 'Розділювач масиву',
      description: `Користувач вводить в перший інпут числа через кому, в інший вводить розмір підмасива і клікає на кнопку
      Код повинен з введених чисел створити масив і повернути двох вимірний масив 
      Користувач ввів 2,3,5,6,7,8,9,2 і в наступному інпуті 2
      результат повинен бути наступним
      [[2,3], [5,6], [7,8], [9,2]]`
    },
    {
      title: 'Алфавіт',
      description: `Користувач вводить речення в інпут і коли користувач забере фокус повинно бути підраховано
      Скільки в реченні кожної букви і вивести в таблиці. На регістр не зважаємо
      
      Тобто введено: "Привіт світ" тут буде 2 букви т 2 букви в одна буква п`
    },
    {
      title: 'Тільки унікальні символи',
      description: `Користувач вводить речення в інпут і коли користувач забере фокус повинно бути виведено в алерті 
      речення тільки унікальних символів
      
      Тобто ввели "Привіт мій світ" => "Привіт мй св" На регістр не зважаємо` 
    },
    {
      title: 'Підсвітка кнопки',
      description: `Створити 10 кнопок коли користувач наводить мишкою на кнопку робити фон кнопки зеленим
      коли мишку забрали фон повинен повернутися до початкового` 
    },
    {
      title: 'Поле пароля',
      description: `Створити поле типу пароль, і кнопку збоку щоб можна було побачити в інпуті введений текст` 
    },
    {
      title: 'Введення дробового числа',
      description:`Створити два інпути користувач вводить дробове число в перший , а в другий до скількох чисел після коми округлювати і повертає число
      
      Користувач ввів 74.57676 і 3 ми повинні вивести в алерті 74.577`,
    },
    {
      title: 'Матриця',
      description:`
      const matrix = [
        [1, 4, 6],
        [2, 5, 7],
        [5, 7, 8]
      ];
      
      Знайти суму елементів кожного внутрішнього масиву, тобто 1 + 4 + 6 = 11, 2 + 5 + 7 = 14 ...`,
    },
  ],
  [
    {
      title: '5 найдовших слів',
      description: `Задано текст, потрібно знайти 5 найдовших слів, На регістр не зважаємо`
    },
    {
      title: '5 найпопулярніших слів',
      description: `Задано текст, потрібно знайти 5 найпопулярніших слів, На регістр не зважаємо`
    },
    {
      title: '5 найменш популярних слів',
      description: `Задано текст, потрібно знайти 5 найменшпопулярних слів, На регістр не зважаємо`
    },
    {
      title: 'Останнє слово',
      description: `Створити функцію яка очікує стрічку і повертає його останнє слово
      func('Hello dear friend') => 'friend'`,
    },
    {
      title: 'TODO app', 
      description: `Задано інпут і кнопку. Введені TODO повинні зберігатися після оновлення сторінки.
      Біля кожного TODO повинна бути кнопка щоб видалити елемент`
    },
    {
      title: 'Генератор форм',
      description: `Створити функціюю яка очікує масив обєктів і створює форму по його елементах
        [
          {
            type: 'input',
            placeholder: 'Your name',
            required: true,
          },
          {
            type: 'select',
            placeholder: 'Country',
            required: true,
            options: ['Ukraine', 'Usa', 'Germany']
          }
          {
            type: 'textarea',
            placeholder: 'Your bio',
            required: false,
          },
          {
            type: 'checkbox',
            placeholder: 'Are you married',
            required: false,
          },
        ]
      `
    },
    {
      title: 'Поле пароля',
      description: `Створити поле типу пароль, і кнопку збоку щоб можна було побачити в інпуті введений текст` 
    },
    {
      title: 'Розділювач масиву',
      description: `Користувач вводить в перший інпут числа через кому, в інший вводить розмір підмасива і клікає на кнопку
      Код повинен з введених чисел створити масив і повернути двох вимірний масив 
      Користувач ввів 2,3,5,6,7,8,9,2 і в наступному інпуті 2
      результат повинен бути наступним
      [[2,3], [5,6], [7,8], [9,2]]`
    },
  ],
  [
    {
      title: 'Тільки унікальні значення',
      description: `Функція очікує безліч масивів, повертає один масив з усіх унікальних значень`
    },
  ]
];