// if
/*
  Завдання: реалізувати ділення числа на число.
  
  Вимоги:
  - Користувач вводить два значення за допомогою двох окремих prompt's
  - Якщо користувач вводить не числове значення хоча б в один prompt, 
    повинно бути виведено повідомлення в консоль що ми підтримуємо 
    тільки число і обрахунок не відбудеться
  - Якщо друге число рівне нулю повинно бути виведено повідомлення в консоль  і обрахунок не відбудеться
  - Якщо обидва значення є числовими і друге не є рівним нулю тоді ми виводимо результат ділення в консоль
*/
