// if && switch

/*
  Завдання: реалізувати конвертер населеного пункту у поштовий індекс.
  
  Львів: 79000	
  Черкаси: 18000
  Тернопіль: 46000
  Одеса: 65000
  Харків: 61000

  Вимоги:
  - Користувач вводить місто за допомогою prompt
  - Якщо користувач вводить не стрічкове значення, повинно бути виведено повідомлення в консоль,
    що ми підтримуємо тільки стрічку і пошук поштового індексу не відбудеться
  - Якщо в нас є поштовий індекс для введеного населеного пункту тоді ми виводимо його в консоль
  - Якщо в нас відсутній поштовий індекс для введеного населеного пункту ми повідомляємо про це в консоль
*/
