export default [
  {
    title: 'Заповнювач масива',
    description: `Створити функцію яка заповнить масив до заданого розміру заданим символом 
    func(8, 'ak') => ['ak','ak','ak','ak','ak','ak','ak','ak']`
  },
  {
    title: 'Екран',
    description: `Створити функцію, яка видаляє зі строки всі символи, які ми передали другим аргументом.. 
    Вихідну строку і символи для видалення задає користувач
    func('Hello, John', 'lo') => 'He, Jhn'`,
  },
  {
    title: 'Обєднювач масивів',
    description: `Створити функцію яка приймає безліч масивів, та обєднює їх в один і повертає
      func([5,6], [6], [8,1]) => [5,6,6,8,1]
    `,
  },
  {
    title: 'Калькулятор',
    description: `Створити функцію doMath(x, znak, y), яка отримує 3 аргументи: числа x і y, строку znak. 
    У змінному знаку можуть бути: +, -, *, /, %, ^ (степіть). 
    Вивести результат математичного дії, зазначеного в змінному знаку. 
    Обидва числа і знак отримуються від користувача.`,
  },
  {
    title: 'Очисник масива',
    description: `Створити функцію яка видаляє з масива усі елементи які рівні заданому символу
    func([2,3,5,6,6,7], 6) => [2,3,5,7]`
  },
 
  {
    title: 'Останнє слово',
    description: `Створити функцію яка очікує стрічку і повертає його останнє слово
    func('Hello dear friend') => 'friend'`,
  },
  {
    title: 'Середнє значення масива',
    description: `Створити функцію яка очікує масив та повертає середнє арифметичне значення елементів масиву
    func([3,10,5]) => 5`,
  },
  {
    title: 'Автошкола',
    description: `Створити функцію яка очікує обєкт та повертає цей обєкт з новою властивість driverLicense
      func({ name: 'Oksana', age: 22,}) => {
        name: 'Oksana',
        age: 22, 
        driverLicense: {
          car: true, 
          bus: true
          truck: false,
        },
      }
      const RULES = {
        car: 18,
        bus: 20,
        truck: 25,
      };
    `,
  },
  {
    title: 'Анкета',
    description: `Створити функцію яка задає користувачу 5 запитань, Імя, Місто, Вік, Країна, Улюблений колір, значення записує в обєкт та поверта
    є його
     Імя повинно бути приведено до верхнього регістру
     Місто повинно бути приведено до нижнього регістру,
     Улюблений колір повиннен чергувати великий та нижній регісти бути ЖоВтИй`,
  },
  {
    title: 'Введення дробового числа',
    description:`Створити функцію яка просить в користувача спочатку ввести дробове число, а потім ввести до скількох чисел після коми округлювати і повертає число
    Користувач ввів 74.57676 і 3 функція повинна повертнути 74.577`,
    
  },
];